docs/thesis_project_proposal.org
#+TITLE: The road first taken: Optimizing choices in logical inference with neural network
#+DATE: June 08, 2020
#+AUTHOR: Kuan Yu

This is a project proposal for my master's thesis in the [[http://www.ling.uni-potsdam.de/cogsys/][Cognitive Systems]] program at the University of Potsdam.
First draft on May 30, 2020.

* Introduction

Logical inference commonly involves a backward search process,
where we check each rule from which the goal can be derived.
The plurality of rules creates branches in the search tree,
and the complexities of nested branches multiply.
When we come to a branching node, we face choices.
Some choices eventually lead us to successful results,
and others to dead ends,
or worse, to infinite loops.

If we wish to retrieve all possible results,
an exhaustive search is unavoidable,
in which case the choices are irrelevant,
since all branches must be traversed, preferably in parallel.
However, in practice, we often need just one successful result which satisfies our goal.
Moreover, in reality, making a wrong choice has far more severe consequences than the computation cost.
For the time being, we guide machines with well-defined goals whose results can be simulated,
but eventually they will have to learn by interacting with the real world.

We propose to augment a general logical inference engine with a neural network responsible for making choices:
a symbolic intelligence with a connectionist brain.
This project will be a rudimentary exploration into this idea.
We will train a neural network in a supervised manner to predict the success rate of choices for prioritization
in order to reduce the breadth and the depth of the subtree traversed before the first successful result is found.

This project aims at laying a solid and extensible groundwork for the following future research directions.
- Replacing supervised training with reinforcement learning, so that the program learns to make better choices through interactions.
- Replacing success rate with more complicated objectives for which the choices are to be optimized.

* Background

** Neural guided logical inference

[[https://arxiv.org/abs/1701.06972][Loos et al. (2017)]] demonstrated the usefulness of deep neural networks for guiding first-order logic proof search,
where the networks were used for ranking clause selections in the [[https://wwwlehre.dhbw-stuttgart.de/~sschulz/E/E.html][E theorem prover]],
which significantly reduced the number of proof search steps.
They experimented with convolutional networks and tree LSTM networks.
[[https://arxiv.org/abs/1805.07563][Kaliszyk et al. (2018)]] successfully applied reinforcement learning for first-order theorem proving,
using tableau calculus for finding refutational proofs.
[[https://arxiv.org/abs/1811.00796][Kusumoto et al. (2018)]] trained graph networks with reinforcement learning
for guiding the construction of proof trees in intuitionistic propositional logic using sequent calculus,
which outperformed Coq's /tauto/ tactic.
These works have shown the power of neural guidance for logical inference in limited contexts.

[[https://arxiv.org/abs/1805.10872][Manhaeve et al. (2018)]] introduced /DeepProbLog/
which integrated neural predicates, e.g. images, into probabilistic logic programming.
[[https://arxiv.org/abs/1901.04195][Marra et al. (2019)]] used graph networks in probabilistic graphical models
with MAP inference for modeling logical reasoning.
These works explored the integration of probabilistic modeling and logical reasoning.
The general direction of their approach, however, diverges from ours.
Our goal is to harness the power of statistical methods
while retaining the definitive nature of symbolic reasoning.

Our approach is heavily inspired by [[https://arxiv.org/abs/1809.02840][Zhang et al. (2018)]]
who showed the benefits of neural guidance for program synthesis.
They experimented with recurrent LSTM networks and gated graph networks
for synthesizing /Scheme/ programs using the /miniKanren/ logic programming system.
The neural networks were trained with supervised curriculum and scheduled sampling
to predict the ground-truth optimal candidates at each step for expanding the partially synthesized program.
We discuss the following details in their work from which [[sec-proposal][our proposal]] differs.

- They used neural networks for embedding constraints which depended on the target synthesis language.
  The synthesis engine consisted of a few relational programs (e.g. =evalo=, =lookupo=)
  each containing several candidate branches of constraints.
  The weights of the networks were specialized for each relational program,
  and the model predicted a distribution over the candidates in that program.
- Their recurrent model was more efficient and performant, but it discarded variable identities.
- During test time, they used a greedy policy.  Only the best predicted candidate was chosen.

