docs/thesis_project_proposal.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-06-08 Mon 12:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The road first taken: Optimizing choices in logical inference with neural network</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Kuan Yu" />
</head>
<body>
<div id="content">
<h1 class="title">The road first taken: Optimizing choices in logical inference with neural network</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org159a67b">1. Introduction</a></li>
<li><a href="#org7f7ee5e">2. Background</a>
<ul>
<li><a href="#org58e545e">2.1. Neural guided logical inference</a></li>
<li><a href="#org8dae726">2.2. The <i>miniKanren</i> language</a></li>
</ul>
</li>
<li><a href="#org5bafaae">3. Project proposal</a>
<ul>
<li><a href="#org6575310">3.1. Where choice happens</a>
<ul>
<li><a href="#org77cddc1">3.1.1. State board</a></li>
<li><a href="#org21f1bf9">3.1.2. Descriptive goals</a></li>
<li><a href="#org25e71bd">3.1.3. Example</a></li>
<li><a href="#orgcb0bf50">3.1.4. Problem: recursive goals</a></li>
</ul>
</li>
<li><a href="#orgd980184">3.2. Neural network</a>
<ul>
<li><a href="#org8a7839a">3.2.1. Description embedding</a></li>
<li><a href="#orgbfa6f8c">3.2.2. Training</a></li>
</ul>
</li>
<li><a href="#orge106d10">3.3. Evaluation</a></li>
</ul>
</li>
<li><a href="#orgb29668a">4. Timeline planning</a>
<ul>
<li><a href="#org65181ea">4.1. June</a></li>
<li><a href="#org2cd319a">4.2. July &amp; August</a></li>
<li><a href="#org1d3336b">4.3. September</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This is a project proposal for my master's thesis in the <a href="http://www.ling.uni-potsdam.de/cogsys/">Cognitive Systems</a> program at the University of Potsdam.
First draft on May 30, 2020.
</p>

<div id="outline-container-org159a67b" class="outline-2">
<h2 id="org159a67b"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Logical inference commonly involves a backward search process,
where we check each rule from which the goal can be derived.
The plurality of rules creates branches in the search tree,
and the complexities of nested branches multiply.
When we come to a branching node, we face choices.
Some choices eventually lead us to successful results,
and others to dead ends,
or worse, to infinite loops.
</p>

<p>
If we wish to retrieve all possible results,
an exhaustive search is unavoidable,
in which case the choices are irrelevant,
since all branches must be traversed, preferably in parallel.
However, in practice, we often need just one successful result which satisfies our goal.
Moreover, in reality, making a wrong choice has far more severe consequences than the computation cost.
For the time being, we guide machines with well-defined goals whose results can be simulated,
but eventually they will have to learn by interacting with the real world.
</p>

<p>
We propose to augment a general logical inference engine with a neural network responsible for making choices:
a symbolic intelligence with a connectionist brain.
This project will be a rudimentary exploration into this idea.
We will train a neural network in a supervised manner to predict the success rate of choices for prioritization
in order to reduce the breadth and the depth of the subtree traversed before the first successful result is found.
</p>

<p>
This project aims at laying a solid and extensible groundwork for the following future research directions.
</p>
<ul class="org-ul">
<li>Replacing supervised training with reinforcement learning, so that the program learns to make better choices through interactions.</li>
<li>Replacing success rate with more complicated objectives for which the choices are to be optimized.</li>
</ul>
</div>
</div>

<div id="outline-container-org7f7ee5e" class="outline-2">
<h2 id="org7f7ee5e"><span class="section-number-2">2</span> Background</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org58e545e" class="outline-3">
<h3 id="org58e545e"><span class="section-number-3">2.1</span> Neural guided logical inference</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<a href="https://arxiv.org/abs/1701.06972">Loos et al. (2017)</a> demonstrated the usefulness of deep neural networks for guiding first-order logic proof search,
where the networks were used for ranking clause selections in the <a href="https://wwwlehre.dhbw-stuttgart.de/~sschulz/E/E.html">E theorem prover</a>,
which significantly reduced the number of proof search steps.
They experimented with convolutional networks and tree LSTM networks.
<a href="https://arxiv.org/abs/1805.07563">Kaliszyk et al. (2018)</a> successfully applied reinforcement learning for first-order theorem proving,
using tableau calculus for finding refutational proofs.
<a href="https://arxiv.org/abs/1811.00796">Kusumoto et al. (2018)</a> trained graph networks with reinforcement learning
for guiding the construction of proof trees in intuitionistic propositional logic using sequent calculus,
which outperformed Coq's <i>tauto</i> tactic.
These works have shown the power of neural guidance for logical inference in limited contexts.
</p>

<p>
<a href="https://arxiv.org/abs/1805.10872">Manhaeve et al. (2018)</a> introduced <i>DeepProbLog</i>
which integrated neural predicates, e.g. images, into probabilistic logic programming.
<a href="https://arxiv.org/abs/1901.04195">Marra et al. (2019)</a> used graph networks in probabilistic graphical models
with MAP inference for modeling logical reasoning.
These works explored the integration of probabilistic modeling and logical reasoning.
The general direction of their approach, however, diverges from ours.
Our goal is to harness the power of statistical methods
while retaining the definitive nature of symbolic reasoning.
</p>

<p>
Our approach is heavily inspired by <a href="https://arxiv.org/abs/1809.02840">Zhang et al. (2018)</a>
who showed the benefits of neural guidance for program synthesis.
They experimented with recurrent LSTM networks and gated graph networks
for synthesizing <i>Scheme</i> programs using the <i>miniKanren</i> logic programming system.
The neural networks were trained with supervised curriculum and scheduled sampling
to predict the ground-truth optimal candidates at each step for expanding the partially synthesized program.
We discuss the following details in their work from which <a href="#org56be12c">our proposal</a> differs.
</p>

<ul class="org-ul">
<li>They used neural networks for embedding constraints which depended on the target synthesis language.
The synthesis engine consisted of a few relational programs (e.g. <code>evalo</code>, <code>lookupo</code>)
each containing several candidate branches of constraints.
The weights of the networks were specialized for each relational program,
and the model predicted a distribution over the candidates in that program.</li>
<li>Their recurrent model was more efficient and performant, but it discarded variable identities.</li>
<li>During test time, they used a greedy policy.  Only the best predicted candidate was chosen.</li>
</ul>
</div>
</div>
