docs/thesis_project_proposal.org
** The /miniKanren/ language

We would like to use [[http://minikanren.org/][/miniKanren/]] as the basis of the logic programming system,
for the following reasons.

- It is an embedded domain specific language with a [[http://webyrd.net/scheme-2013/papers/HemannMuKanren2013.pdf][minimal core]] which is easy to implement.
  It has been implemented in over 40 host languages,
  covering almost every common platforms.
- It is a general logic programming system à la /Prolog/,
  based on unification resolution,
  supporting recursion or whatever the host language has to offer.
- It is an extensible system, with numerous extensions
  such as [[http://www.schemeworkshop.org/2011/papers/Alvis2011.pdf][constraint programming]], [[http://webyrd.net/alphamk/alphamk_workshop.pdf][nominal logic]], and [[https://github.com/webyrd/probKanren][probabilistic logic programming]].
- It has well-understood [[http://okmij.org/ftp/papers/LogicT.pdf][computational effects]].
  By default it performs an interleaving breadth-first search,
  but this behavior can be easily changed to depth-first search or [[http://webyrd.net/scheme-2013/papers/Swords2013.pdf][guided search]].

Here we introduce the [[https://github.com/webyrd/miniKanren-with-symbolic-constraints][canonical /Scheme/ version]] of the language with some basic examples followed by explanations.

#+BEGIN_SRC scheme
(run* [q] (== 1 q))
;; (1)
#+END_SRC

- The macro =run*= takes a list of query variables and one or more goal expressions,
  and returns the list of all results satisfying the goals.
- The goal constructor ~==~ is used for unification.

#+BEGIN_SRC scheme
(run* [p q]
  (conde
   [(== 0 p) (== 0 q)]
   [(== 1 q) (== 2 q)]
   [(== 3 p) (== 3 q)]))
;; ((0 0) (3 3))
#+END_SRC

- The macro =conde= takes a number of goal lists,
  creates the conjunctions of goals within each list,
  and returns the goal of their disjunction.

#+BEGIN_SRC scheme
(run* [q]
  (fresh [q]
    (== 0 q))
  (== 1 q))
;; (1)
#+END_SRC

- The macro =fresh= has a syntax similar to =run*=,
  but returns a goal with freshly created variables.
  It can be read as the existential quantifier.

#+BEGIN_SRC scheme
(define (appendo l s out)
  (conde
   [(== '() l) (== s out)]
   [(fresh [a d res]
      (== (cons a d) l)
      (== (cons a res) out)
      (appendo d s res))]))

(run* [r] (appendo '(1 2) '(3 4) r))
;; ((1 2 3 4))

(run* [p q] (appendo p q '(1 2 3 4)))
;; ((() (1 2 3 4))
;;  ((1) (2 3 4))
;;  ((1 2) (3 4))
;;  ((1 2 3) (4))
;;  ((1 2 3 4) ()))
#+END_SRC

- Goal constructors such as =appendo= are functions which return goals.
  They are conventionally named with an =o= at the end.

A literal and clumsy translation of the =appendo= example in /Prolog/ is as follows.

#+BEGIN_SRC prolog
appendo(L,S,Out) :- L = [], S = Out.
appendo(L,S,Out) :- L = [A|D], Out = [A|Res], appendo(D,S,Res).

?- appendo([1,2],[3,4],R).
%@ R = [1, 2, 3, 4].

?- appendo(P,Q,[1,2,3,4]).
%@ P = [],
%@ Q = [1, 2, 3, 4] ;
%@ P = [1],
%@ Q = [2, 3, 4] ;
%@ P = [1, 2],
%@ Q = [3, 4] ;
%@ P = [1, 2, 3],
%@ Q = [4] ;
%@ P = [1, 2, 3, 4],
%@ Q = [] ;
%@ false.
#+END_SRC

* <<sec-proposal>>Project proposal

** Where choice happens

We start with a [[https://github.com/ysmiraak/phynaster/blob/9c0e813833ed6bb1c78f89e46e249a4d6ccc9017/src/phynaster/logic2.clj#L85-L92][modified implementation]] of /miniKanren/.
Here we first discuss the important aspects of modifications,
and then give an example for where the neural network comes into play.

