docs/thesis_project_proposal.html

<div id="outline-container-org8dae726" class="outline-3">
<h3 id="org8dae726"><span class="section-number-3">2.2</span> The <i>miniKanren</i> language</h3>
<div class="outline-text-3" id="text-2-2">
<p>
We would like to use <a href="http://minikanren.org/"><i>miniKanren</i></a> as the basis of the logic programming system,
for the following reasons.
</p>

<ul class="org-ul">
<li>It is an embedded domain specific language with a <a href="http://webyrd.net/scheme-2013/papers/HemannMuKanren2013.pdf">minimal core</a> which is easy to implement.
It has been implemented in over 40 host languages,
covering almost every common platforms.</li>
<li>It is a general logic programming system à la <i>Prolog</i>,
based on unification resolution,
supporting recursion or whatever the host language has to offer.</li>
<li>It is an extensible system, with numerous extensions
such as <a href="http://www.schemeworkshop.org/2011/papers/Alvis2011.pdf">constraint programming</a>, <a href="http://webyrd.net/alphamk/alphamk_workshop.pdf">nominal logic</a>, and <a href="https://github.com/webyrd/probKanren">probabilistic logic programming</a>.</li>
<li>It has well-understood <a href="http://okmij.org/ftp/papers/LogicT.pdf">computational effects</a>.
By default it performs an interleaving breadth-first search,
but this behavior can be easily changed to depth-first search or <a href="http://webyrd.net/scheme-2013/papers/Swords2013.pdf">guided search</a>.</li>
</ul>

<p>
Here we introduce the <a href="https://github.com/webyrd/miniKanren-with-symbolic-constraints">canonical <i>Scheme</i> version</a> of the language with some basic examples followed by explanations.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #707183;">(</span>run* <span style="color: #7388D6;">[</span>q<span style="color: #7388D6;">]</span> <span style="color: #7388D6;">(</span>== 1 q<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">(1)</span>
</pre>
</div>

<ul class="org-ul">
<li>The macro <code>run*</code> takes a list of query variables and one or more goal expressions,
and returns the list of all results satisfying the goals.</li>
<li>The goal constructor <code>==</code> is used for unification.</li>
</ul>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #707183;">(</span>run* <span style="color: #7388D6;">[</span>p q<span style="color: #7388D6;">]</span>
  <span style="color: #7388D6;">(</span>conde
   <span style="color: #909183;">[</span><span style="color: #709870;">(</span>== 0 p<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>== 0 q<span style="color: #709870;">)</span><span style="color: #909183;">]</span>
   <span style="color: #909183;">[</span><span style="color: #709870;">(</span>== 1 q<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>== 2 q<span style="color: #709870;">)</span><span style="color: #909183;">]</span>
   <span style="color: #909183;">[</span><span style="color: #709870;">(</span>== 3 p<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>== 3 q<span style="color: #709870;">)</span><span style="color: #909183;">]</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">((0 0) (3 3))</span>
</pre>
</div>

<ul class="org-ul">
<li>The macro <code>conde</code> takes a number of goal lists,
creates the conjunctions of goals within each list,
and returns the goal of their disjunction.</li>
</ul>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #707183;">(</span>run* <span style="color: #7388D6;">[</span>q<span style="color: #7388D6;">]</span>
  <span style="color: #7388D6;">(</span>fresh <span style="color: #909183;">[</span>q<span style="color: #909183;">]</span>
    <span style="color: #909183;">(</span>== 0 q<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>== 1 q<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">(1)</span>
</pre>
</div>

<ul class="org-ul">
<li>The macro <code>fresh</code> has a syntax similar to <code>run*</code>,
but returns a goal with freshly created variables.
It can be read as the existential quantifier.</li>
</ul>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #0000FF;">define</span> <span style="color: #7388D6;">(</span><span style="color: #006699;">appendo</span> l s out<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>conde
   <span style="color: #909183;">[</span><span style="color: #709870;">(</span>== '<span style="color: #907373;">()</span> l<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>== s out<span style="color: #709870;">)</span><span style="color: #909183;">]</span>
   <span style="color: #909183;">[</span><span style="color: #709870;">(</span>fresh <span style="color: #907373;">[</span>a d res<span style="color: #907373;">]</span>
      <span style="color: #907373;">(</span>== <span style="color: #6276BA;">(</span>cons a d<span style="color: #6276BA;">)</span> l<span style="color: #907373;">)</span>
      <span style="color: #907373;">(</span>== <span style="color: #6276BA;">(</span>cons a res<span style="color: #6276BA;">)</span> out<span style="color: #907373;">)</span>
      <span style="color: #907373;">(</span>appendo d s res<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">]</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span>run* <span style="color: #7388D6;">[</span>r<span style="color: #7388D6;">]</span> <span style="color: #7388D6;">(</span>appendo '<span style="color: #909183;">(</span>1 2<span style="color: #909183;">)</span> '<span style="color: #909183;">(</span>3 4<span style="color: #909183;">)</span> r<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">((1 2 3 4))</span>

<span style="color: #707183;">(</span>run* <span style="color: #7388D6;">[</span>p q<span style="color: #7388D6;">]</span> <span style="color: #7388D6;">(</span>appendo p q '<span style="color: #909183;">(</span>1 2 3 4<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">((() (1 2 3 4))</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">((1) (2 3 4))</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">((1 2) (3 4))</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">((1 2 3) (4))</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">((1 2 3 4) ()))</span>
</pre>
</div>

<ul class="org-ul">
<li>Goal constructors such as <code>appendo</code> are functions which return goals.
They are conventionally named with an <code>o</code> at the end.</li>
</ul>

<p>
A literal and clumsy translation of the <code>appendo</code> example in <i>Prolog</i> is as follows.
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="color: #006699;">appendo</span><span style="color: #707183;">(</span><span style="color: #BA36A5;">L</span>,<span style="color: #BA36A5;">S</span>,<span style="color: #BA36A5;">Out</span><span style="color: #707183;">)</span> :- <span style="color: #BA36A5;">L</span> = <span style="color: #707183;">[]</span>, <span style="color: #BA36A5;">S</span> = <span style="color: #BA36A5;">Out</span>.
<span style="color: #006699;">appendo</span><span style="color: #707183;">(</span><span style="color: #BA36A5;">L</span>,<span style="color: #BA36A5;">S</span>,<span style="color: #BA36A5;">Out</span><span style="color: #707183;">)</span> :- <span style="color: #BA36A5;">L</span> = <span style="color: #707183;">[</span><span style="color: #BA36A5;">A</span><span style="color: #0000FF;">|</span><span style="color: #BA36A5;">D</span><span style="color: #707183;">]</span>, <span style="color: #BA36A5;">Out</span> = <span style="color: #707183;">[</span><span style="color: #BA36A5;">A</span><span style="color: #0000FF;">|</span><span style="color: #BA36A5;">Res</span><span style="color: #707183;">]</span>, appendo<span style="color: #707183;">(</span><span style="color: #BA36A5;">D</span>,<span style="color: #BA36A5;">S</span>,<span style="color: #BA36A5;">Res</span><span style="color: #707183;">)</span>.

?- appendo<span style="color: #707183;">(</span><span style="color: #7388D6;">[</span>1,2<span style="color: #7388D6;">]</span>,<span style="color: #7388D6;">[</span>3,4<span style="color: #7388D6;">]</span>,<span style="color: #BA36A5;">R</span><span style="color: #707183;">)</span>.
<span style="color: #8D8D84;">%</span><span style="color: #8D8D84; font-style: italic;">@ R = [1, 2, 3, 4].</span>

?- appendo<span style="color: #707183;">(</span><span style="color: #BA36A5;">P</span>,<span style="color: #BA36A5;">Q</span>,<span style="color: #7388D6;">[</span>1,2,3,4<span style="color: #7388D6;">]</span><span style="color: #707183;">)</span>.
<span style="color: #8D8D84;">%</span><span style="color: #8D8D84; font-style: italic;">@ P = [],</span>
<span style="color: #8D8D84;">%</span><span style="color: #8D8D84; font-style: italic;">@ Q = [1, 2, 3, 4] ;</span>
<span style="color: #8D8D84;">%</span><span style="color: #8D8D84; font-style: italic;">@ P = [1],</span>
<span style="color: #8D8D84;">%</span><span style="color: #8D8D84; font-style: italic;">@ Q = [2, 3, 4] ;</span>
<span style="color: #8D8D84;">%</span><span style="color: #8D8D84; font-style: italic;">@ P = [1, 2],</span>
<span style="color: #8D8D84;">%</span><span style="color: #8D8D84; font-style: italic;">@ Q = [3, 4] ;</span>
<span style="color: #8D8D84;">%</span><span style="color: #8D8D84; font-style: italic;">@ P = [1, 2, 3],</span>
<span style="color: #8D8D84;">%</span><span style="color: #8D8D84; font-style: italic;">@ Q = [4] ;</span>
<span style="color: #8D8D84;">%</span><span style="color: #8D8D84; font-style: italic;">@ P = [1, 2, 3, 4],</span>
<span style="color: #8D8D84;">%</span><span style="color: #8D8D84; font-style: italic;">@ Q = [] ;</span>
<span style="color: #8D8D84;">%</span><span style="color: #8D8D84; font-style: italic;">@ false.</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5bafaae" class="outline-2">
<h2 id="org5bafaae"><span class="section-number-2">3</span> <a id="org56be12c"></a>Project proposal</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org6575310" class="outline-3">
<h3 id="org6575310"><span class="section-number-3">3.1</span> Where choice happens</h3>
<div class="outline-text-3" id="text-3-1">
<p>
We start with a <a href="https://github.com/ysmiraak/phynaster/blob/9c0e813833ed6bb1c78f89e46e249a4d6ccc9017/src/phynaster/logic2.clj#L85-L92">modified implementation</a> of <i>miniKanren</i>.
Here we first discuss the important aspects of modifications,
and then give an example for where the neural network comes into play.
</p>
</div>
