docs/thesis_project_proposal.html

<div id="outline-container-org77cddc1" class="outline-4">
<h4 id="org77cddc1"><span class="section-number-4">3.1.1</span> State board</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
In <i>miniKanren</i>, a goal is a function which takes an inference state as input and returns a transformed state.
The transformed state could be one of the following.
</p>

<ul class="org-ul">
<li>A state, where the goal is satisfied.</li>
<li>A thunk, which is a function of no argument, and when called returns a transformed state.</li>
<li>A pair containing a state and a thunk.</li>
<li>A failure.</li>
</ul>

<p>
The two user-interface macros <code>fresh</code> and <code>conde</code> automatically wraps inner goals in thunks to delay their effects.
When the results are being pulled (for instance by <code>run*</code>),
first the global goal is called on the initial state,
and then depending on the output,
further actions are taken.
If the output is a thunk, it means that no result has been reached yet.
The thunk is executed to expose the first subgoal to the current state,
which may spawn another thunk if more subgoals are to be called.
If the output is a pair, it means that the global goal contains some disjunction of subgoals,
and that one of the branches has reached a result.
</p>

<p>
This design, while simple, only allows for binary branching in general, and therefore, binary choices.
In our implementation, we used a record type <code>Board</code> to aggregate transformed states.
A board consists of three queues.
</p>

<ul class="org-ul">
<li>A queue of states, which are the fruitful leaf nodes of the search tree.</li>
<li>A queue of thunks, which are the unfinished branches, waiting to be explored.</li>
<li>A queue of failed states, which exist only for the purpose of analysis.</li>
</ul>

<p>
If the thunk queue is empty, the search tree is fully explored.
Otherwise, to advance the search process,
we pop the first thunk and execute it.
If the first subgoal in the thunk (namely the current goal) is a disjunctive,
then more thunks may be spawned and appended to the thunk queue.
This way, we rotate and explore unfinished branches,
performing a breadth-first search.
Had we used a stack for storing thunks,
then a depth-first search would be performed.
</p>

<p>
As an example, the following global goal with five subgoals in a nested disjunctive form
will expose and explore those subgoals in their indexed order.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span>| g1
   <span style="color: #7388D6;">(</span>| <span style="color: #909183;">(</span>| g4
         g5<span style="color: #909183;">)</span>
      g3<span style="color: #7388D6;">)</span>
   g2<span style="color: #707183;">)</span>
</pre>
</div>

<p>
To prioritize the exploration of difference branches,
we simply use a priority queue for storing thunks,
with the priorities assigned by the neural network model.
</p>
</div>
</div>

<div id="outline-container-org21f1bf9" class="outline-4">
<h4 id="org21f1bf9"><span class="section-number-4">3.1.2</span> Descriptive goals</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
We added descriptions to the goals in the form of symbolic expressions,
which are used by the neural network model for predicting the probability of success.
</p>

<p>
The symbolic descriptions are constructed inductively as follows.
</p>

<p>
<a id="orge9f5510"></a>
</p>
<pre class="example">
Description :=
| (ConstraintName Data ...)
| (&amp; Description ...)
| (| Description ...)

ConstraintName :=
| ==
| !=
| domain
| ...

Data :=
| Constant
| Variable
| List

List := (list* Data ... Tail)
Tail := nil | Variable
</pre>

<p>
The symbols in the language are from either
a finite pool of constants,
a finite pool of variables,
or a fixed pool of special symbols including constraint names, <code>&amp;</code>, <code>|</code>, <code>list*</code>, and <code>nil</code>.
</p>

<p>
The constants and variables are atomic data.
Compound data are represented as lists.
Here we use a special list format <code>list*</code>,
which is a hybrid between <code>cons</code> and <code>list</code>.
On one hand,
the <code>cons</code> cell representation (e.g. <code>(cons a (cons b (cons c nil)))</code>) results in deeply nested expressions,
making it slower for the neural network to process,
and the gradient flow during backpropagation difficult.
On the other hand,
the flatten <code>list</code> representation (e.g. <code>(list a b c)</code>) lacks the ability to have a logical variable sitting as the tail,
which removes the usefulness of lists for representing partially generated expressions during logical inference.
Therefore, we adopt a hybrid representation <code>list*</code>,
translating <code>(cons a (cons b (cons c tail)))</code> as <code>(list* a b c tail)</code>
where <code>tail</code> is either <code>nil</code> or a logical variable.
This method gives us an efficient list representation retaining its inductive structure
which makes it expressive enough for representing arbitrary algebraic expressions.
</p>

<p>
A goal description is a symbolic expression whose head is a special symbol representing the goal constructor.
Goal constructors include constraints (equality <code>==</code>, disequality <code>!=</code>, finite domain <code>domain</code>, etc.)
and connectives (<code>&amp;</code> and <code>|</code>).
</p>
</div>
</div>

<div id="outline-container-org25e71bd" class="outline-4">
<h4 id="org25e71bd"><span class="section-number-4">3.1.3</span> <a id="org72050bb"></a>Example</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
Here is a sample goal description.
For readability, we use keywords (<code>:p</code>, <code>:q</code>, and <code>:r</code>) to represent logical variables.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span>&amp; <span style="color: #7388D6;">(</span>== <span style="color: #909183;">(</span>list* 1 <span style="color: #D0372D;">:p</span> <span style="color: #D0372D;">:r</span><span style="color: #909183;">)</span> <span style="color: #D0372D;">:q</span><span style="color: #7388D6;">)</span>
   <span style="color: #7388D6;">(</span>| <span style="color: #909183;">(</span>&amp; <span style="color: #709870;">(</span>== <span style="color: #D0372D;">:r</span> <span style="color: #D0372D;">nil</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>== <span style="color: #D0372D;">:p</span> 2<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>== <span style="color: #D0372D;">:p</span> 4<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
   <span style="color: #7388D6;">(</span>!= <span style="color: #909183;">(</span>list* 1 2 <span style="color: #D0372D;">nil</span><span style="color: #909183;">)</span> <span style="color: #D0372D;">:q</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
This global goal contains one disjunctive with two branches.
After initialization, the inference board contains two thunks,
each containing its current local goal with the respective description as follows.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">thunk 1</span>
<span style="color: #707183;">(</span>&amp; <span style="color: #7388D6;">(</span>== <span style="color: #D0372D;">:r</span> <span style="color: #D0372D;">nil</span><span style="color: #7388D6;">)</span>
   <span style="color: #7388D6;">(</span>== <span style="color: #D0372D;">:p</span> 2<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">thunk 2</span>
<span style="color: #707183;">(</span>== <span style="color: #D0372D;">:p</span> 4<span style="color: #707183;">)</span>
</pre>
</div>

<p>
We will run a neural network on the global goal description,
as well as the local goal descriptions,
to produce embedded representations in a shared vector space.
For each thunk,
the global embedding and the local embedding are then combined in the final output layer to predict its success rate.
</p>

<p>
A useful neural network should rank thunk 2 higher than thunk 1,
since thunk 1 will fails due to the disequality constraint,
but thunk 2 will produce one successful result.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">{</span><span style="color: #D0372D;">:p</span> 4, <span style="color: #D0372D;">:q</span> <span style="color: #7388D6;">(</span>1 4 . ?0<span style="color: #7388D6;">)</span>, <span style="color: #D0372D;">:r</span> ?0<span style="color: #707183;">}</span>
</pre>
</div>

<p>
Namely,
<code>:p</code> unifies with the constant <code>4</code>,
<code>:q</code> unifies with the list <code>(list* 1 4 :r)</code>,
and <code>:r</code> remains unbound.
</p>
</div>
</div>
