docs/thesis_project_proposal.html

<div id="outline-container-orgcb0bf50" class="outline-4">
<h4 id="orgcb0bf50"><span class="section-number-4">3.1.4</span> Problem: recursive goals</h4>
<div class="outline-text-4" id="text-3-1-4">
<p>
Consider <code>nato</code>, a recursively defined goal.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #0000FF;">define</span> <span style="color: #7388D6;">(</span><span style="color: #006699;">nato</span> n<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #008000;">| (== 'z n)</span>
<span style="color: #008000;">     (fresh [m]</span>
<span style="color: #008000;">       (== (list* 's m) n)</span>
<span style="color: #008000;">       (nato m))))</span>
</pre>
</div>

<p>
While this goal can be constructed and executed without termination problems,
due to its recursive part being contained in a thunk,
the description of this goal, however, is an infinite expression.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span>| <span style="color: #7388D6;">(</span>== 'z <span style="color: #D0372D;">:n</span><span style="color: #7388D6;">)</span>
   <span style="color: #7388D6;">(</span>&amp; <span style="color: #909183;">(</span>== <span style="color: #709870;">(</span>list* 's <span style="color: #D0372D;">:n1</span><span style="color: #709870;">)</span> <span style="color: #D0372D;">:n</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>| <span style="color: #709870;">(</span>== 'z <span style="color: #D0372D;">:n1</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>&amp; <span style="color: #907373;">(</span>== <span style="color: #6276BA;">(</span>list* 's <span style="color: #D0372D;">:n2</span><span style="color: #6276BA;">)</span> <span style="color: #D0372D;">:n1</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span>| <span style="color: #6276BA;">(</span>== 'z <span style="color: #D0372D;">:n2</span><span style="color: #6276BA;">)</span>
               <span style="color: #6276BA;">(</span>&amp; <span style="color: #858580;">(</span>== <span style="color: #80A880;">(</span>list* 's <span style="color: #D0372D;">:n3</span><span style="color: #80A880;">)</span> <span style="color: #D0372D;">:n2</span><span style="color: #858580;">)</span>
                  ...<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
We propose an ad hoc treatment to this problem:
We replace the recursive part of the description with a special expression <code>(rec Variable ...)</code>
where <code>rec</code> is a new special symbol.
</p>

<p>
This way, the goal <code>(nato :n)</code> has the following global description.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span>| <span style="color: #7388D6;">(</span>== 'z <span style="color: #D0372D;">:n</span><span style="color: #7388D6;">)</span>
   <span style="color: #7388D6;">(</span>&amp; <span style="color: #909183;">(</span>== <span style="color: #709870;">(</span>list* 's <span style="color: #D0372D;">:n1</span><span style="color: #709870;">)</span> <span style="color: #D0372D;">:n</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>rec <span style="color: #D0372D;">:n1</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
And the subgoal <code>(rec :n')</code> when dethunked will have the following description.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span>| <span style="color: #7388D6;">(</span>== 'z <span style="color: #D0372D;">:n1</span><span style="color: #7388D6;">)</span>
   <span style="color: #7388D6;">(</span>&amp; <span style="color: #909183;">(</span>== <span style="color: #709870;">(</span>list* 's <span style="color: #D0372D;">:n2</span><span style="color: #709870;">)</span> <span style="color: #D0372D;">:n1</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>rec <span style="color: #D0372D;">:n2</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd980184" class="outline-3">
<h3 id="orgd980184"><span class="section-number-3">3.2</span> Neural network</h3>
<div class="outline-text-3" id="text-3-2">
<p>
As mentioned in the <a href="#org72050bb">example</a> above,
we will use a neural network to predict the success rate of a thunk based on its global and local goal descriptions.
Here we first describe a recursive attention network for embedding descriptions,
and then discuss the training process.
</p>
</div>

<div id="outline-container-org8a7839a" class="outline-4">
<h4 id="org8a7839a"><span class="section-number-4">3.2.1</span> Description embedding</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
Following the <a href="#orge9f5510">definition of descriptions</a> above,
we propose to embed each sub-expression recursively using one attention network.
</p>

<p>
We start with a learned embedding matrix for special symbols and atomic data types.
The embedding matrix consists of three regions,
respectively for special symbols, constants, and variables.
The number of special symbols are predetermined by the logic programming language,
crucially the available types of constraints.
Although an indefinite number of constants and variables are needed for solving problems of arbitrary complexities,
we have to sacrifice that flexibility in order to interface with the neural model.
Luckily, in practice, most problems require only a manageable amount of constants and variables.
The success rate of a goal should stay invariant under consistent permutations of variables.
This invariance must be learned to the model (see <a href="#orga2f0882">training</a>).
Likewise, with the limited types of constraints under consideration (equality, disequality, and finite domain),
the mapping of constants is permutable as well.
</p>

<p>
After the embedding lookup for the aforementioned atomic symbols,
we use the attention network to embed each compound expression <code>(expr-0 expr-1 ... expr-N)</code> recursively.
We follow the attention mechanism of <a href="https://arxiv.org/abs/1706.03762">Vaswani et al. (2017)</a>
and apply it in two stages.
Firstly, self-attention allows each sub-expression to query all other sub-expressions,
producing \(N+1\) vectors, which are sometimes known as annotations in the neural machine translation literature.
Secondly, we take the annotation for the head expression <code>expr-0</code> to query the annotations for the other sub-expressions,
producing the final embedding vector for the whole expression.
</p>

<p>
One major characteristic of attention networks in comparison to the alternatives such as recurrent or convolutional networks
is that they are naturally positional invariant.
For instance, there is no difference in processing <code>(== p q)</code> versus <code>(== q p)</code>,
or <code>(&amp; f g)</code> versus <code>(&amp; g f)</code>.
This property is a big advantage since all goal constructors under our consideration are commutative.
However, for lists, such as <code>(list* a b c ... tail)</code>,
the sequential ordering of sub-expressions are important.
Here we apply the commonly used sinusoidal position encoding.
</p>
</div>
</div>

<div id="outline-container-orgbfa6f8c" class="outline-4">
<h4 id="orgbfa6f8c"><span class="section-number-4">3.2.2</span> <a id="orga2f0882"></a>Training</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
The neural network is trained to predict the success rate of a thunk in a supervised manner.
</p>

<p>
In the simple case, a thunk when executed either fails or produces a successful state.
The target for prediction is binary.
However, when the thunk contains disjunctive goals,
then more thunks will be produced,
some of which may fail, and others succeed.
As long as all the spawned thunks terminate,
we can still take the success ratio,
and train the model to minimize binary cross entropy.
</p>

<p>
In the worst case, the thunk may recursively spawn infinitely many,
or a finite but intractable number of thunks.
Then the success rate has to be estimated.
Techniques from reinforcement learning can be useful here,
such as Monte Carlo tree search.
However, we do not expect this to happen for problems under our consideration.
Note that not all recursive goals produce infinitely spawning thunks,
since some constraints may fail the recursive branch.
Problems in practice can usually be described with constraints
which make the solution space finite,
and improve the efficiency of search.
</p>

<p>
One major obstacle in training a recursive model is that the training examples are difficult to batch.
We propose an experimental method for mini-batching.
Each batch is produced from just one example,
but with randomized mappings for constants and variables.
The model should learn the invariance of mapping permutation,
and rely on no additional information in the embedding apart from the different identities of constants and variables.
The effectiveness of this method is up to investigation.
We will examine the embedding matrix and the attention alignment to analyse what the model learns,
and adjust our method accordingly.
</p>
</div>
</div>
</div>
