docs/thesis_project_proposal.html

<div id="outline-container-orge106d10" class="outline-3">
<h3 id="orge106d10"><span class="section-number-3">3.3</span> Evaluation</h3>
<div class="outline-text-3" id="text-3-3">
<p>
The purpose of the neural network model is to assign weights to choices,
so that the logical inference engine could prioritize branches which are more likely to succeed.
</p>

<p>
We propose two metrics for evaluation.
</p>

<ol class="org-ol">
<li>The number of dead ends (failure states) met before finding the first successful result.</li>
<li>The number of choices made in producing the first successful result.</li>
</ol>

<p>
These two metrics reflect the cost of inference regarding respectively the breadth of search and the depth of search.
</p>

<p>
We will reserve examples from each problem category,
and compare the metrics when running inference on them
with and without the neural network model.
</p>
</div>
</div>
</div>

<div id="outline-container-orgb29668a" class="outline-2">
<h2 id="orgb29668a"><span class="section-number-2">4</span> Timeline planning</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org65181ea" class="outline-3">
<h3 id="org65181ea"><span class="section-number-3">4.1</span> June</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>find adviser and refine project idea</li>
<li>determine problem datasets</li>
<li>complete minikanren implementation</li>
<li>produce training data</li>
<li>register thesis</li>
</ul>
</div>
</div>

<div id="outline-container-org2cd319a" class="outline-3">
<h3 id="org2cd319a"><span class="section-number-3">4.2</span> July &amp; August</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>train neural network</li>
<li>evaluation and introspection</li>
<li>adjustments and further experiments</li>
</ul>
</div>
</div>

<div id="outline-container-org1d3336b" class="outline-3">
<h3 id="org1d3336b"><span class="section-number-3">4.3</span> September</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>finish thesis paper</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: June 08, 2020</p>
<p class="author">Author: Kuan Yu</p>
<p class="date">Created: 2020-06-08 Mon 12:37</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
